%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み

%*********************************制御設定*********************************
ALT_CNT_flag_disable_kaisei = 0.0;            % 0の時 回生制御有り　 1の時 回生制御無し（一定発電）

%*********************************オルタネータ*****************************
%******目標電圧値****************
ALT_CNT_Alter_V_Kaisei_V = 14.0;     % 目標回生時電圧(V)
ALT_CNT_Alter_V_BASE_V = 13.5;     % 基本目標オルタ電圧値(V)
ALT_CNT_V_Battely_Kudo_V = 12.0;     %オルタ下限電圧値(V)

%******発電禁止条件****************
ALT_CNT_ALT_ON_RPM_HYS_rpm  = 1000.0;  % オルタネータ発電開始エンジン回転数(ヒス処理) [rpm]
ALT_CNT_ALT_OFF_RPM_HYS_rpm = 600.0;   % オルタネータ発電OFFエンジン回転数(ヒス処理) [rpm]
