%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み

%*********************************シミュレーション設定*********************************
% end_time           = 1800;         % シミュレーション時間[s]
% sampling_time      = 0.001;         % サンプリング周期[s]
num_tws_mabiki     = 10;            % エフェクトToWorkspace間引き数[-]

%*********************************物理定数*********************************
g           = 9.80665;              % 重力加速度[m/s2]
HIJU        = 783;                  % レギュラーガソリン比重[g/L]

%*********************************その他定数*********************************
ON = 1;
OFF = 0;

ZERO = 0;
ONE = 1;

%*********************************単位変換係数*********************************
percent2mujigen = 0.01;       % ％→無次元
mujigen2percent = 100;        % 無次元→％
radpsec2rpm = 60/(2*pi);      % rad/sec → rpm
kmph2mps = 1000/3600;         % km/h → m/sec
mps2kmph = 3.6;               % m/sec → km/h
h2sec = 3600;                 % Hour -> sec
sec2h = 1/3600;               % sec -> Hour
mps2kmps = 1/1000;            % m/s -> km/s

g2L = 1/HIJU;                 % g→L ガソリン


%*********************************目標車速情報*********************************
Mode = csvread('WLTC_100ms_spline.csv');   

%*******************************エンジン温度情報*********************************
T_ENG_K = csvread('T_ENG_K_100ms_spline.csv');   

%*******************************エンジン温度情報*********************************
T_PT_TH_K = csvread('T_PT_TH_K_100ms_spline.csv');   

%*******************************TM雰囲気温度情報*********************************
T_air_K = csvread('T_air_K_100ms_spline.csv');   

%*********************************環境変数*********************************
rou         = 1.205;                % 空気密度[kg/m3]

%*********************************車両情報*********************************
%車両諸元
M           = 1738  ;                 % 車両重量[kg]
myu         = 0.007 ;                 % μ 転がり抵抗係数[N/N]
Cd          = 0.4000;                  % 空気抵抗係数[-]
A           = 1.5   ;                  % 前面投影面積[m2]
tire_r      = 0.334 ;                 % タイヤ動半径[m]
vel_max     = 200   ;                  % 最大車両速度[km/h]  （発散防止用）
