%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%*********************************ドライバーモデル*********************************

%アクセル開度 FB
ACC_P_Gain = 15;                    % フィードバック制御 Pゲイン値[-]
ACC_I_Gain = 10;                    % フィードバック制御 Iゲイン値[-]
ACC_D_Gain = 0;                     % フィードバック制御 Dゲイン値[-]


%ドライバ逆算マップ
load('driver_model_throttlemap.mat')

%ブレーキ
Brk_PGain  = -5000;                  % ブレーキ力Gain[-]

%ブレーキ制動力上下限値
Brk_UL = 5000;  
Brk_LL = 0;

%ドライバブレーキ
Driver_Brake_Const1 = -1;   %停止時（目標車速が0km/h）のブレーキ踏込量
Driver_Brake_Const3 = 0;    %加速時（目標車速が正の時）のブレーキ踏込量

Driver_Brake_Switch_Const2 = 0.1; % ドライバブレーキモデル時停止判定(km/h)
Driver_Brk_sh = 0.01;   %加速判定(km/h/sec)

% ***ドライバ状態***
% %ドライバ状態
Thresh_Stop_vCar = 0.1;    %車速停止条件(km/h)
%  
% % ドライバモード
%  %ドライバ状態   1:停止 2:加速 3:減速(力行) 4:減速(回生) 5:定常走行
drivmode_STOP = 1;          %ドライバ状態   1:停止        
drivmode_ACC = 2;           %ドライバ状態   2:加速
drivmode_GensokuRikko = 3;  %ドライバ状態   3:減速(力行)
drivmode_GensokuKaisei = 4; %ドライバ状態   4:減速(回生)
drivmode_CONST = 5;         %ドライバ状態   5:定常走行

%モニタ
fuel_0guard = 0.02;   %  燃費0割防止(L)
fuelcomsnp_0 = 0;     %  0割時燃費(km/L)
