%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み

% %*************************************CVT制御******************************
%     
% CVT回転比算出 Pゲイン値
TM_CNT_Gain_CVT_ECU = 0.01;


% %***************************LockUpClutch***********************************
% %from_OFF_2_ON


%*********************************ロックアップ目標スリップ回転数*****************************


%ロックアップクラッチECU
TM_CNT_LU_Clutch_RelayON_rpm = 500;  % ロックアップON 指示回転数
TM_CNT_LU_Clutch_RelayOFF_rpm=150;   % ロックアップ解除 指示回転数


% 目標スリップ回転数MAP -x 車速 speed [km/h]
TM_CNT_LU_slip_rpm_map_x_speed_kmph = [0.0 ,10.0 ,15.0 ,20.0 ,25.0 ,40.0 ,60.0 ,80.0 ];

% 目標スリップ回転数MAP -y スロットルバルブ開度 throttle valve open [deg]
TM_CNT_LU_slip_rpm_map_y_TVO = [0.0 ,10.0 ,15.0 ,20.0 ,25.0 ,40.0 ,60.0 ,80.0 ];

% 目標スリップ回転数MAP[rpm]
TM_CNT_LU_slip_rpm_map = [
600.0 ,0.0 ,0.0 ,0.0 ,0.0 ,0.0 ,0.0 ,0.0 ;
700.0 ,200.0 ,0.0 ,0.0 ,0.0 ,0.0 ,0.0 ,0.0; 
800.0 ,400.0 ,200.0 ,0.0 ,0.0 ,0.0 ,0.0 ,0.0; 
900.0 ,600.0 ,400.0 ,200.0 ,0.0 ,0.0 ,0.0 ,0.0; 
1000.0 ,800.0 ,600.0 ,400.0 ,0.0 ,0.0 ,0.0 ,0.0 ;
1200.0 ,1000.0 ,800.0 ,600.0 ,300.0 ,0.0 ,0.0 ,0.0; 
1400.0 ,1200.0 ,1000.0 ,800.0 ,600.0 ,300.0 ,0.0 ,0.0 ;
1600.0 ,1400.0 ,1200.0 ,1000.0 ,700.0 ,400.0 ,0.0 ,0.0 ];



%*********************************CVTプライマリ目標回転数算出*****************************

% プライマリ目標回転数テーブル　-x スロットルバルブ開度 [deg]
TM_CNT_CVTpritgt_rpm_table_x_TVO = [0.0 ,5.0 ,10.0 ,20.0 ,30.0 ,40.0 ,50.0 ,60.0 ,80.0]; 

% プライマリ目標回転数テーブル [rpm]
TM_CNT_CVTpritgt_rpm_table = [600.0 ,1462.5 ,2250.0 ,3600.0 ,4650.0 ,5400.0 ,5850.0 ,6000.0 ,6000.0]; 

%**************** CVT ****************

%CVT入力下限回転数
TM_CNT_CVT_radpmin_min_rpm = 3 * radpsec2rpm;

%プーリー上下限ガード値
TM_CNT_CVT_ratio_LL = 0.3; %ドライバ側のアクセル開度ＦＦ項にも同名変数あり
TM_CNT_CVT_ratio_UL = 2.5;

%プーリー変位量上下限ガード値
TM_CNT_delta_CVT_ratio_LL = -0.001;
TM_CNT_delta_CVT_ratio_UL =  0.002;


%*****************************熱マネ関連******************************
%***********CVTF warmer Control**************
TM_CNT_CVTFwarmer_KpW                   = [1000,1000,0.01,0.01]; %冷間時のCVTFウォーマー熱抵抗[K/W]
TM_CNT_CVTFwarmer_KpW_x_T_ENGCoolant    = [  20,  50,  60,  90]; %このテーブルのx軸　エンジン冷却水温度[℃]

TM_CNT_CVTFwarmer_cold_Coolant_KpW      = 1000; %CVTFよりエンジン冷却水が冷たい時のCVTFウォーマー熱抵抗[K/W]

TM_CNT_CVTFwarmer2_KpW                  = [1000,1000,0.01,0.01]; %CVTFが熱い時のCVTFウォーマー熱抵抗[K/W]
TM_CNT_CVTFwarmer2_KpW_x_T_CVTF          = [  20,  50,  60,  90]; %このテーブルのx軸　CVTF温度[℃]
